app/controllers/api/matches_controller.rb

  def index
    @users = User.where(approved: true)
    @mentees = Mentee.where(approved: true)
    @users.each do |mentor|
---
SELECT "users".* FROM "users" WHERE "users"."approved" = $1  [["approved", "t"]]
SELECT "mentees".* FROM "mentees" WHERE "mentees"."approved" = $1  [["approved", "t"]]
SELECT "users".* FROM "users"