app/controllers/api/mentees_controller.rb

INSERT INTO "mentees" ("created_at", "updated_at", "age", "city", "country", "first_name", "last_name", "phone", "facebook", "email", "college", "major", "instagram_bio_text", "instagram_bio_why_not_text", "share_major_rank", "industry", "share_industry_rank", "provide", "video_URL", "high_school") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @mentee = Mentee.new(mentee_params)

    if @mentee.save

SELECT "mentees".* FROM "mentees" WHERE "mentees"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users"
---
  def index
    @mentees = Mentee.all.includes(:user)

SELECT  "mentees".* FROM "mentees" WHERE "mentees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "mentees" SET "approved" = $1, "phone" = $2, "high_school" = $3, "college" = $4, "major" = $5, "employer" = $6, "instagram_bio_text" = $7, "instagram_bio_why_not_text" = $8, "night_text" = $9, "not_on_google_text" = $10, "how_impact_text" = $11, "no_discuss_text" = $12, "extra_info_text" = $13, "tier" = $14, "updated_at" = $15 WHERE "mentees"."id" = $16
---
  def update
    @mentee = Mentee.find(params[:id])

    # better logic - if only difference is user_id, do this check
    # otherwise don't

    if !@mentee.user_id.nil?
      render plain: 'Someone must have just taken this mentee :/ Please select another mentee.', status: 478
      # render json: @mentee.errors.full_messages, status: 422
    elsif @mentee.update(mentee_params)