app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at", "age", "city", "country", "first_name", "last_name", "phone", "facebook", "email", "college", "major", "employer", "share_major_rank", "industry", "share_industry_rank", "job_description", "linkedin", "provide", "unblock_methods", "video_URL") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "approved" = $1, "phone" = $2, "picture_url" = $3, "high_school" = $4, "college" = $5, "major" = $6, "employer" = $7, "personality_text" = $8, "why_mentor_text" = $9, "extra_info_text" = $10, "created_at" = $11, "updated_at" = $12 WHERE "users"."id" = $13
---
  def update
    @user = User.find(params[:id])
    if @user.update(admin_user_params)